app/controllers/api/v1/transactions/find_controller.rb

  def index
    render json: Transaction.where(transaction_params)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."updated_at" = $1  [["updated_at", "2017-08-17 18:59:33 UTC"]]

  def show
    render json: Transaction.find_by(transaction_params)
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."created_at" = $1 LIMIT $2  [["created_at", "2017-08-17 18:59:33 UTC"], ["LIMIT", 1]]