app/controllers/api/v1/merchants/find_controller.rb

SELECT "merchants".* FROM "merchants" WHERE "merchants"."updated_at" = $1  [["updated_at", "2017-08-17 18:59:32 UTC"]]
---
  def index
    render json: Merchant.where(merchant_params)

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."created_at" = $1 LIMIT $2  [["created_at", "2017-08-17 18:59:32 UTC"], ["LIMIT", 1]]
---
  def show
    render json: Merchant.find_by(merchant_params)